<?php

declare(strict_types=1);

return [
    'authenticate' => [
        'error'      => 'مدارک ارائه شده اشتباه است.',
        'success'    => 'احراز هویت با موفقیت انجام شد',
        'registered' => 'ثبت‌نام با موفقیت انجام شد',
        'logout'     => 'خروج با موفقیت انجام شد. تمامی نشست‌های فعال به پایان رسیده‌اند.',
    ],
    'entity' => [
        'synced'         => 'تمام :entity با موفقیت همگام سازی شدند.',
        'list_retrieved' => 'بازیابی تمام :entity با موفقیت انجام شد.',
        'retrieved'      => 'بازیابی :entity با موفقیت انجام شد.',
        'created'        => ':entity با موفقیت ایجاد شد.',
        'updated'        => ':entity با موفقیت به‌روزرسانی شد.',
        'deleted'        => ':entity با موفقیت حذف شد.',
    ],
    'error' => [
        'not_found'    => ':entity یافت نشد.',
        'bad_request'  => 'درخواست شما حاوی داده‌های نامعتبر یا خراب است.',
        'unauthorized' => 'شما مجاز به انجام این عمل نیستید.',
        'forbidden'    => 'شما ممنوع‌شده‌اید از انجام این عمل.',
        'server_error' => 'سرور با یک خطای داخلی مواجه شد.',
    ],
];
